# Design the Database Model/ERD

- Create a new model in MySQL and create the ERD to match the stakeholders' specifications, using appropriate SQL data types and lengths for each column

In [1]:
# import packages
import pandas as pd
from sqlalchemy.types import *

In [2]:
# load cleaned files
basic = pd.read_csv('Data/basics.csv')
basic.head(10)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama
5,tt0100275,movie,The Wandering Soap Opera,La Telenovela Errante,0,2017.0,NaN,80,"Comedy,Drama,Fantasy"
6,tt0103340,movie,Life for Life: Maximilian Kolbe,Zycie za zycie. Maksymilian Kolbe,0,2006.0,NaN,90,"Biography,Drama"
7,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery"
8,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
9,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama"

In [3]:
basic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

In [4]:
rating = pd.read_csv('Data/rating.csv')
rating.head(10)

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846
5  tt0100275            6.5       347
6  tt0103340            6.3       354
7  tt0108549            7.7        33
8  tt0113026            5.6      1406
9  tt0113092            3.4       837

In [5]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

## Checking datatypes and length for basic table

In [6]:
basictconst_length = basic['tconst'].fillna('').map(len).max()
basictconst_length

10

In [7]:
primarytitle_length = basic['primaryTitle'].fillna('').map(len).max()
primarytitle_length

242

In [8]:
basic['startYear'].dtypes

dtype('float64')

In [9]:
#basic['startYear']=basic['startYear'].astype(int)
basic['startYear'].dtypes

dtype('float64')

In [10]:
basic['runtimeMinutes'].dtypes

dtype('int64')

---

## Checking datatypes and length for rating table

In [11]:
ratingtconst_length = rating['tconst'].fillna('').map(len).max()
ratingtconst_length

10

In [12]:
rating['averageRating'].dtypes

dtype('float64')

In [13]:
rating['numVotes'].dtypes

dtype('int64')

## Display ERD

![png](Data/movieERD.png)

## Insert Title Basics and Ratings Data with Python

In [14]:
# Connect to MySQL database with pandas and sqlalchemy.
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()

In [15]:
username='root'
password='Sa123685'
connection = f"mysql+pymysql://{username}:{password}@localhost/movies"
conn = create_engine(connection)

In [16]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [17]:
#Show tables in the database to confirm connection
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

## Loading Data into Tables

In [19]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(11)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year  decimal(5,1)  YES         None
3        runtime           int  YES         None

In [20]:
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime'], dtype=object)

In [21]:
basic.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [22]:
# Create new dataframe as title_basics with columns matching with the database
# table columns
title_basics = basic[['tconst','primaryTitle','startYear','runtimeMinutes']]
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

In [23]:
# Change column names to match with database title_basic table columns
rename_dict={"primaryTitle":"primary_title",
             "startYear":"start_year",
            "runtimeMinutes":"runtime"}
title_basics=title_basics.rename(rename_dict,axis=1)
title_basics.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [24]:
describe[['Field','Type']]

           Field          Type
0         tconst   varchar(11)
1  primary_title  varchar(255)
2     start_year  decimal(5,1)
3        runtime           int

In [25]:
title_basics.dtypes

tconst            object
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [26]:
title_basics.to_sql("title_basics",conn,index=False, if_exists='append')

86979

---

In [28]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field          Type Null  Key Default Extra
0           tconst   varchar(11)   NO  PRI    None
1   average_rating  decimal(3,1)  YES         None
2  number_of_votes           int  YES         None

In [29]:
describe['Field'].values

array(['tconst', 'average_rating', 'number_of_votes'], dtype=object)

In [30]:
rating.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [31]:
# Change column names to match with database title_basic table columns
rename_dict_rating={"averageRating":"average_rating",
             "numVotes":"number_of_votes"}
rating=rating.rename(rename_dict_rating,axis=1)
rating.head()

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [32]:
rating.to_sql('ratings',conn,index=False,if_exists='append')

71900

## Confirm the Database has been updated correctly

In [33]:
q = """ SHOW TABLES"""
pd.read_sql(q,conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [34]:
#Check to make sure dtypes have not been changed
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(11)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year  decimal(5,1)  YES         None
3        runtime           int  YES         None

In [35]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field          Type Null  Key Default Extra
0           tconst   varchar(11)   NO  PRI    None
1   average_rating  decimal(3,1)  YES         None
2  number_of_votes           int  YES         None

In [36]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [39]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)
describe

      Field         Type Null  Key Default Extra
0    tconst  varchar(11)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [41]:
# Preview first 5 rows of each table in database
q = '''SELECT * FROM title_basics LIMIT 5'''
pd.read_sql(q, conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [42]:
q = '''SELECT * FROM ratings LIMIT 5'''
pd.read_sql(q, conn)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [43]:
q = '''SELECT * FROM title_genres LIMIT 5'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

- No data has been inserted yet

In [44]:
q = '''SELECT * FROM genres LIMIT 5'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

- No data has been inserted yet